zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal.h
/**
  ******************************************************************************
  * @file    stm32mp13xx_hal.h
  * @author  MCD Application Team
  * @brief   This file contains all the functions prototypes for the HAL
  *          module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32MP13xx_HAL_H
#define STM32MP13xx_HAL_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_hal_conf.h"

/** @addtogroup STM32MP13xx_HAL_Driver
  * @{
  */

/** @addtogroup HAL
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/** @defgroup HAL_Exported_Types HAL Exported Types
  * @{
  */
/** @defgroup HAL_Exported_Types_Group1 Tick Frequency
  * @{
  */
typedef enum
{
  HAL_TICK_FREQ_10HZ         = 100U,
  HAL_TICK_FREQ_100HZ        = 10U,
  HAL_TICK_FREQ_1KHZ         = 1U,
  HAL_TICK_FREQ_DEFAULT      = HAL_TICK_FREQ_1KHZ
} HAL_TickFreqTypeDef;
/**
  * @}
  */

/** @defgroup HAL_Exported_Types_Group2 HDP SW Signal
  * @{
  */

/**
  * @brief  HDP SW Signal SET and Bit RESET enumeration
  */
typedef enum
{
  HDP_SW_SIGNAL_RESET = 0,
  HDP_SW_SIGNAL_SET
} HDP_SwSignalState;
/**
  * @}
  */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup HAL_Exported_Constants HAL Exported Constants
  * @{
  */

/** @defgroup HAL_Exported_Constants_Group1 SYSCFG VREFBUF Voltage Scale
  * @{
  */
#define SYSCFG_VREFBUF_VOLTAGE_SCALE0   VREFBUF_CSR_VRS_OUT1   /*!< Voltage reference scale 0 (VREF_OUT1) */
#define SYSCFG_VREFBUF_VOLTAGE_SCALE1   VREFBUF_CSR_VRS_OUT2   /*!< Voltage reference scale 1 (VREF_OUT2) */
#define SYSCFG_VREFBUF_VOLTAGE_SCALE2   VREFBUF_CSR_VRS_OUT3   /*!< Voltage reference scale 2 (VREF_OUT3) */
#define SYSCFG_VREFBUF_VOLTAGE_SCALE3   VREFBUF_CSR_VRS_OUT4   /*!< Voltage reference scale 3 (VREF_OUT4) */


#define IS_SYSCFG_VREFBUF_VOLTAGE_SCALE(__SCALE__)  (((__SCALE__) == SYSCFG_VREFBUF_VOLTAGE_SCALE0) || \
                                                     ((__SCALE__) == SYSCFG_VREFBUF_VOLTAGE_SCALE1) || \
                                                     ((__SCALE__) == SYSCFG_VREFBUF_VOLTAGE_SCALE2) || \
                                                     ((__SCALE__) == SYSCFG_VREFBUF_VOLTAGE_SCALE3))


/**
  * @}
  */

/** @defgroup HAL_Exported_Constants_Group2 SYSCFG VREFBUF High Impedance
  * @{
  */
#define SYSCFG_VREFBUF_HIGH_IMPEDANCE_DISABLE  ((uint32_t)0x00000000U) /*!< VREF_plus pin is internally connected to Voltage reference buffer output */
#define SYSCFG_VREFBUF_HIGH_IMPEDANCE_ENABLE   VREFBUF_CSR_HIZ        /*!< VREF_plus pin is high impedance */

#define IS_SYSCFG_VREFBUF_HIGH_IMPEDANCE(__VALUE__)  (((__VALUE__) == SYSCFG_VREFBUF_HIGH_IMPEDANCE_DISABLE) || \
                                                      ((__VALUE__) == SYSCFG_VREFBUF_HIGH_IMPEDANCE_ENABLE))

#define IS_SYSCFG_VREFBUF_TRIMMING(__VALUE__)  (((__VALUE__) > 0U) && ((__VALUE__) <= VREFBUF_CCR_TRIM))

/**
  * @}
  */


/** @defgroup HAL_Exported_Constants_Group3 SYSCFG Ethernet Config
  * @{
  */
#if defined (SYSCFG_DUAL_ETH_SUPPORT)
#define SYSCFG_ETH1_MII                     ((uint32_t)0x00000000)          /*!< Select the Media Independent Interface */
#define SYSCFG_ETH1_RMII                    SYSCFG_PMCSETR_ETH1_SEL_2       /*!< Select the Reduced Media Independent Interface */
#define SYSCFG_ETH1_RGMII                   SYSCFG_PMCSETR_ETH1_SEL_0       /*!< Select the Reduced Gigabit Media Independent Interface */

#define SYSCFG_ETH2_MII                     ((uint32_t)0x00000000)          /*!< Select the Media Independent Interface */
#define SYSCFG_ETH2_RMII                    SYSCFG_PMCSETR_ETH2_SEL_2       /*!< Select the Reduced Media Independent Interface */
#define SYSCFG_ETH2_RGMII                   SYSCFG_PMCSETR_ETH2_SEL_0       /*!< Select the Reduced Gigabit Media Independent Interface */

#define IS_SYSCFG_ETHERNET_CONFIG(CONFIG) (((CONFIG) == SYSCFG_ETH1_MII)       || \
                                           ((CONFIG) == SYSCFG_ETH1_RMII)       || \
                                           ((CONFIG) == SYSCFG_ETH1_RGMII)      || \
                                           ((CONFIG) == SYSCFG_ETH2_MII)        || \
                                           ((CONFIG) == SYSCFG_ETH2_RMII)       || \
                                           ((CONFIG) == SYSCFG_ETH2_RGMII))
#endif /* SYSCFG_DUAL_ETH_SUPPORT */

/**
  * @}
  */


/** @defgroup HAL_Exported_Constants_Group5 SYSCFG IOCompenstionCell Config
  * @{
  */
#define SYSCFG_CELL_CODE                    ((uint32_t)0x00000000)  /*!< Select Code from the cell */
#define SYSCFG_REGISTER_CODE                SYSCFG_CMPCR_SW_CTRL    /*!< Code from the SYSCFG compensation cell code register */

#define IS_SYSCFG_CODE_SELECT(SELECT) (((SELECT) == SYSCFG_CELL_CODE)|| \
                                       ((SELECT) == SYSCFG_REGISTER_CODE))

#define IS_SYSCFG_CODE_CONFIG(CONFIG) ((CONFIG) < (0x10U))

#define SYSCFG_MAIN_COMP_CELL               (0x1U << 1)
#define SYSCFG_SD1_COMP_CELL                (0x1U << 2)
#define SYSCFG_SD2_COMP_CELL                (0x1U << 3)


/** @brief  Check SYSCFG Main Compensation Cell Ready flag is set or not.
  * @retval State of bit (1 or 0)
  */
#define __HAL_SYSCFG_MAIN_CMP_CELL_GET_FLAG() ((READ_BIT(SYSCFG->CMPCR, SYSCFG_CMPCR_READY)\
                                                == (SYSCFG_CMPCR_READY)) ? 1U : 0U)

/** @brief  Check SYSCFG SDMMC1 Compensation Cell Ready flag is set or not.
  * @retval State of bit (1 or 0)
  */
#define __HAL_SYSCFG_SD1_CMP_CELL_GET_FLAG() ((READ_BIT(SYSCFG->CMPSD1CR, SYSCFG_CMPSD1CR_READY)\
                                               == (SYSCFG_CMPSD1CR_READY)) ? 1U : 0U)

/** @brief  Check SYSCFG SDMMC2 Compensation Cell Ready flag is set or not.
  * @retval State of bit (1 or 0)
  */
#define __HAL_SYSCFG_SD2_CMP_CELL_GET_FLAG() ((READ_BIT(SYSCFG->CMPSD2CR, SYSCFG_CMPSD2CR_READY)\
                                               == (SYSCFG_CMPSD2CR_READY)) ? 1U : 0U)

/**
  * @brief  Get Main I/O compensation cell value for PMOS transistors
  * @retval The Main I/O compensation cell value for PMOS transistors
  */
#define __HAL_SYSCFG_MAIN_CELL_GET_PMOS_CMP() (READ_BIT(SYSCFG->CMPCR, SYSCFG_CMPCR_APSRC))

/**
  * @brief  Get Main I/O compensation cell value for NMOS transistors
  * @retval Returned value is the Main I/O compensation cell value for NMOS transistors
  */
#define __HAL_SYSCFG_MAIN_CELL_GET_NMOS_CMP() (READ_BIT(SYSCFG->CMPCR, SYSCFG_CMPCR_ANSRC))

/**
  * @brief  Get SDMMC1 I/O compensation cell value for PMOS transistors
  * @retval The SDMMC1 I/O compensation cell value for PMOS transistors
  */
#define __HAL_SYSCFG_SD1_CELL_GET_PMOS_CMP() (READ_BIT(SYSCFG->CMPSD1CR, SYSCFG_CMPSD1CR_APSRC))

/**
  * @brief  Get SDMMC1 I/O compensation cell value for NMOS transistors
  * @retval Returned value is the SDMMC1 I/O compensation cell value for NMOS transistors
  */
#define __HAL_SYSCFG_SD1_CELL_GET_NMOS_CMP() (READ_BIT(SYSCFG->CMPSD1CR, SYSCFG_CMPSD1CR_ANSRC))

/**
  * @brief  Get SDMMC2 I/O compensation cell value for PMOS transistors
  * @retval The SDMMC2 I/O compensation cell value for PMOS transistors
  */
#define __HAL_SYSCFG_SD2_CELL_GET_PMOS_CMP() (READ_BIT(SYSCFG->CMPSD2CR, SYSCFG_CMPSD2CR_APSRC))

/**
  * @brief  Get SDMMC2 I/O compensation cell value for NMOS transistors
  * @retval Returned value is the SDMMC2 I/O compensation cell value for NMOS transistors
  */
#define __HAL_SYSCFG_SD2_CELL_GET_NMOS_CMP() (READ_BIT(SYSCFG->CMPSD2CR, SYSCFG_CMPSD2CR_ANSRC))

/**
  * @}
  */

