zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal.h
/** @defgroup HAL_Exported_Constants_Group6 SYSCFG IOControl HighSpeed Config
  * @{
  */
#define SYSCFG_HIGHSPEED_TRACE_SIGNAL   (0x1U << 0)   /*!< High Speed Low Voltage Pad mode Enable when a TRACEx signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_QUADSPI_SIGNAL (0x1U << 1)   /*!< High Speed Low Voltage Pad mode Enable when a QUADSPI_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_ETH1_SIGNAL    (0x1U << 2)   /*!< High Speed Low Voltage Pad mode Enable when a ETH_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_ETH2_SIGNAL    (0x1U << 3)   /*!< High Speed Low Voltage Pad mode Enable when a ETH_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SDMMC1_SIGNAL  (0x1U << 4)   /*!< High Speed Low Voltage Pad mode Enable when a SDMMCy_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SDMMC2_SIGNAL  (0x1U << 5)   /*!< High Speed Low Voltage Pad mode Enable when a SDMMCy_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SPI1_SIGNAL    (0x1U << 6)   /*!< High Speed Low Voltage Pad mode Enable when a SPIy_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SPI2_SIGNAL    (0x1U << 7)   /*!< High Speed Low Voltage Pad mode Enable when a SPIy_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SPI3_SIGNAL    (0x1U << 8)   /*!< High Speed Low Voltage Pad mode Enable when a SPIy_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SPI4_SIGNAL    (0x1U << 9)   /*!< High Speed Low Voltage Pad mode Enable when a SPIy_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_SPI5_SIGNAL    (0x1U << 10)  /*!< High Speed Low Voltage Pad mode Enable when a SPIy_x signal is selected in AFMUX */
#define SYSCFG_HIGHSPEED_LTDC_SIGNAL    (0x1U << 11)  /*!< High Speed Low Voltage Pad mode Enable when a LTDCy_x signal is selected in AFMUX */

/**
  * @}
  */


/** @defgroup HAL_Exported_Constants_Group7 HDP Software signal define
  * @{
  */
#define HDP_SW_SIGNAL_0                 ((uint8_t)0x01U)  /* HDP Software signal 0 selected    */
#define HDP_SW_SIGNAL_1                 ((uint8_t)0x02U)  /* HDP Software signal 1 selected    */
#define HDP_SW_SIGNAL_2                 ((uint8_t)0x04U)  /* HDP Software signal 2 selected    */
#define HDP_SW_SIGNAL_3                 ((uint8_t)0x08U)  /* HDP Software signal 3 selected    */
#define HDP_SW_SIGNAL_4                 ((uint8_t)0x10U)  /* HDP Software signal 4 selected    */
#define HDP_SW_SIGNAL_5                 ((uint8_t)0x20U)  /* HDP Software signal 5 selected    */
#define HDP_SW_SIGNAL_6                 ((uint8_t)0x40U)  /* HDP Software signal 6 selected    */
#define HDP_SW_SIGNAL_7                 ((uint8_t)0x80U)  /* HDP Software signal 7 selected    */

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/** @defgroup DBGMCU_Exported_Macros DBGMCU Exported Macros
  * @{
  */

/** @brief  Freeze/Unfreeze Peripherals in Debug mode
  */
#if defined(DBGMCU_APB4_FZ_DBG_IWDG2_STOP)
#define __HAL_DBGMCU_FREEZE_IWDG2()           SET_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4_FZ_DBG_IWDG2_STOP)
#define __HAL_DBGMCU_UNFREEZE_IWDG2()         CLEAR_BIT(DBGMCU->APB4FZ1, DBGMCU_APB4_FZ_DBG_IWDG2_STOP)
#endif /* DBGMCU_APB4_FZ_DBG_IWDG2_STOP */

#if defined(DBGMCU_APB1_FZ_DBG_TIM2_STOP)
#define __HAL_DBGMCU_FREEZE_TIM2()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_TIM2_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM2()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_TIM2_STOP)
#endif /* DBGMCU_APB1_FZ_DBG_TIM2_STOP */
#if defined(DBGMCU_APB1_FZ_DBG_TIM3_STOP)
#define __HAL_DBGMCU_FREEZE_TIM3()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_TIM3_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM3()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_TIM3_STOP)
#endif /* DBGMCU_APB1_FZ_DBG_TIM3_STOP */
#if defined(DBGMCU_APB1_FZ_DBG_TIM4_STOP)
#define __HAL_DBGMCU_FREEZE_TIM4()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_TIM4_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM4()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_TIM4_STOP)
#endif /* DBGMCU_APB1_FZ_DBG_TIM3_STOP */
#if defined(DBGMCU_APB1_FZ_DBG_TIM5_STOP)
#define __HAL_DBGMCU_FREEZE_TIM5()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_TIM5_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM5()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_TIM5_STOP)
#endif /* DBGMCU_APB1_FZ_DBG_TIM5_STOP */
#if defined(DBGMCU_APB1_FZ_DBG_TIM6_STOP)
#define __HAL_DBGMCU_FREEZE_TIM6()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_TIM6_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM6()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_TIM6_STOP)
#endif /* DBGMCU_APB1_FZ_DBG_TIM6_STOP */
#if defined(DBGMCU_APB1_FZ_DBG_TIM7_STOP)
#define __HAL_DBGMCU_FREEZE_TIM7()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_TIM7_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM7()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_TIM7_STOP)
#endif /* DBGMCU_APB1_FZ_DBG_TIM7_STOP */
#if defined(DBGMCU_APB1_FZ_DBG_LPTIM1_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM1()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_LPTIM1_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM1()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_LPTIM1_STOP)
#endif /* DBGMCU_APB1_FZ_DBG_LPTIM1_STOP */
#if defined(DBGMCU_APB1_FZ_DBG_I2C1_STOP)
#define __HAL_DBGMCU_FREEZE_I2C1()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_I2C1_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C1()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_I2C1_STOP)
#endif /* DBGMCU_APB1_FZ_DBG_I2C1_STOP */
#if defined(DBGMCU_APB1_FZ_DBG_I2C2_STOP)
#define __HAL_DBGMCU_FREEZE_I2C2()           SET_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_I2C2_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C2()         CLEAR_BIT(DBGMCU->APB1FZ1, DBGMCU_APB1_FZ_DBG_I2C2_STOP)
#endif /* DBGMCU_APB1_FZ_DBG_I2C2_STOP */

#if defined(DBGMCU_APB2_FZ_DBG_TIM1_STOP)
#define __HAL_DBGMCU_FREEZE_TIM1()           SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2_FZ_DBG_TIM1_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM1()         CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2_FZ_DBG_TIM1_STOP)
#endif /* DBGMCU_APB2_FZ_DBG_TIM1_STOP */
#if defined(DBGMCU_APB2_FZ_DBG_TIM8_STOP)
#define __HAL_DBGMCU_FREEZE_TIM8()           SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2_FZ_DBG_TIM8_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM8()         CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2_FZ_DBG_TIM8_STOP)
#endif /* DBGMCU_APB2_FZ_DBG_TIM8_STOP */
#if defined(DBGMCU_APB2_FZ_DBG_FDCAN_STOP)
#define __HAL_DBGMCU_FREEZE_FDCAN()           SET_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2_FZ_DBG_FDCAN_STOP)
#define __HAL_DBGMCU_UNFREEZE_FDCAN()         CLEAR_BIT(DBGMCU->APB2FZ1, DBGMCU_APB2_FZ_DBG_FDCAN_STOP)
#endif /* DBGMCU_APB2_FZ_DBG_FDCAN_STOP */

#if defined(DBGMCU_APB3_FZ_DBG_LPTIM2_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM2()           SET_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3_FZ_DBG_LPTIM2_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM2()         CLEAR_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3_FZ_DBG_LPTIM2_STOP)
#endif /* DBGMCU_APB3_FZ_DBG_LPTIM2_STOP */
#if defined(DBGMCU_APB3_FZ_DBG_LPTIM3_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM3()           SET_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3_FZ_DBG_LPTIM3_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM3()         CLEAR_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3_FZ_DBG_LPTIM3_STOP)
#endif /* DBGMCU_APB3_FZ_DBG_LPTIM3_STOP */
#if defined(DBGMCU_APB3_FZ_DBG_LPTIM4_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM4()           SET_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3_FZ_DBG_LPTIM4_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM4()         CLEAR_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3_FZ_DBG_LPTIM4_STOP)
#endif /* DBGMCU_APB3_FZ_DBG_LPTIM4_STOP */
#if defined(DBGMCU_APB3_FZ_DBG_LPTIM5_STOP)
#define __HAL_DBGMCU_FREEZE_LPTIM5()           SET_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3_FZ_DBG_LPTIM5_STOP)
#define __HAL_DBGMCU_UNFREEZE_LPTIM5()         CLEAR_BIT(DBGMCU->APB3FZ1, DBGMCU_APB3_FZ_DBG_LPTIM5_STOP)
#endif /* DBGMCU_APB3_FZ_DBG_LPTIM5_STOP */

#if defined(DBGMCU_APB5_FZ_DBG_IWDG1_STOP)
#define __HAL_DBGMCU_FREEZE_IWDG1()           SET_BIT(DBGMCU->APB5FZ1, DBGMCU_APB5_FZ_DBG_IWDG1_STOP)
#define __HAL_DBGMCU_UNFREEZE_IWDG1()         CLEAR_BIT(DBGMCU->APB5FZ1, DBGMCU_APB5_FZ_DBG_IWDG1_STOP)
#endif /* DBGMCU_APB5_FZ_DBG_IWDG1_STOP */
#if defined(DBGMCU_APB5_FZ_DBG_RTC_STOP)
#define __HAL_DBGMCU_FREEZE_RTC()           SET_BIT(DBGMCU->APB5FZ1, DBGMCU_APB5_FZ_DBG_RTC_STOP)
#define __HAL_DBGMCU_UNFREEZE_RTC()         CLEAR_BIT(DBGMCU->APB5FZ1, DBGMCU_APB5_FZ_DBG_RTC_STOP)
#endif /* DBGMCU_APB5_FZ_DBG_RTC_STOP */

#if defined(DBGMCU_APB6_FZ_DBG_I2C3_STOP)
#define __HAL_DBGMCU_FREEZE_I2C3()           SET_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_I2C3_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C3()         CLEAR_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_I2C3_STOP)
#endif /* DBGMCU_APB6_FZ_DBG_I2C3_STOP */
#if defined(DBGMCU_APB6_FZ_DBG_I2C4_STOP)
#define __HAL_DBGMCU_FREEZE_I2C4()           SET_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_I2C4_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C4()         CLEAR_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_I2C4_STOP)
#endif /* DBGMCU_APB6_FZ_DBG_I2C4_STOP */
#if defined(DBGMCU_APB6_FZ_DBG_I2C5_STOP)
#define __HAL_DBGMCU_FREEZE_I2C5()           SET_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_I2C5_STOP)
#define __HAL_DBGMCU_UNFREEZE_I2C5()         CLEAR_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_I2C5_STOP)
#endif /* DBGMCU_APB6_FZ_DBG_I2C5_STOP */
#if defined(DBGMCU_APB6_FZ_DBG_TIM12_STOP)
#define __HAL_DBGMCU_FREEZE_TIM12()           SET_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_TIM12_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM12()         CLEAR_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_TIM12_STOP)
#endif /* DBGMCU_APB6_FZ_DBG_TIM12_STOP */
#if defined(DBGMCU_APB6_FZ_DBG_TIM13_STOP)
#define __HAL_DBGMCU_FREEZE_TIM13()           SET_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_TIM13_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM13()         CLEAR_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_TIM13_STOP)
#endif /* DBGMCU_APB6_FZ_DBG_TIM13_STOP */
#if defined(DBGMCU_APB6_FZ_DBG_TIM14_STOP)
#define __HAL_DBGMCU_FREEZE_TIM14()           SET_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_TIM14_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM14()         CLEAR_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_TIM14_STOP)
#endif /* DBGMCU_APB6_FZ_DBG_TIM14_STOP */
#if defined(DBGMCU_APB6_FZ_DBG_TIM15_STOP)
#define __HAL_DBGMCU_FREEZE_TIM15()           SET_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_TIM15_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM15()         CLEAR_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_TIM15_STOP)
#endif /* DBGMCU_APB6_FZ_DBG_TIM15_STOP */
#if defined(DBGMCU_APB6_FZ_DBG_TIM16_STOP)
#define __HAL_DBGMCU_FREEZE_TIM16()           SET_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_TIM16_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM16()         CLEAR_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_TIM16_STOP)
#endif /* DBGMCU_APB6_FZ_DBG_TIM16_STOP */
#if defined(DBGMCU_APB6_FZ_DBG_TIM17_STOP)
#define __HAL_DBGMCU_FREEZE_TIM17()           SET_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_TIM17_STOP)
#define __HAL_DBGMCU_UNFREEZE_TIM17()         CLEAR_BIT(DBGMCU->APB6FZ1, DBGMCU_APB6_FZ_DBG_TIM17_STOP)
#endif /* DBGMCU_APB6_FZ_DBG_TIM17_STOP */

/**
   * @}
   */

/** @defgroup HDP_Exported_Macros HDP Exported Macros
   * @{
   */

/** @addtogroup HDP_Enable
  * @{
  */
#define __HAL_HDP_ENABLE()                                         SET_BIT(HDP->HDP_CTRL, HDP_CTRL_EN)
/**
  * @}
  */



/** @addtogroup HDP_Configure_SW_Programmable_Signals
  * @{
  */

/** @brief  This macros allows atomic write of HDP_GPOVAL register
            It uses HDP_GPOSET and HDP_GPOCLR registers to toggle
  *
  * @param  __HDP_SW_Signal__: specifies the sw signal bit to be written.
  *          This parameter can be one of HDP_SW_SIGNAL_x(s) where x can be (0..7).
  * @param  __HDP_SwSignalState__: specifies the value to be written to the selected bit.
  *          This parameter can be one of the HDP_SwSignalState enum values:
  *            @arg HDP_SW_SIGNAL_RESET: to clear the signal pin
  *            @arg HDP_SW_SIGNAL_SET: to set the signal pin
  */
#define __HAL_HDP_ATOMIC_WRITE_GPOVAL(__HDP_SW_Signal__, __HDP_SwSignalState__)      \
  do {                                                                 \
    if ((__HDP_SwSignalState__) != HDP_SW_SIGNAL_RESET)                                         \
    {                                                                \
      WRITE_REG(HDP->HDP_GPOSET, (uint8_t)(__HDP_SW_Signal__));            \
    }                                                                \
    else                                                             \
    {                                                                \
      WRITE_REG(HDP->HDP_GPOCLR, (uint8_t)(__HDP_SW_Signal__));            \
    }                                                                \
  } while(0)

/** @brief  This macros allows non-atomic write of HDP_GPOVAL register
  *
  * @param __GPOValue__: specifies the value to set in HDP_GPOVAL register
  *
  */
#define __HAL_HDP_NON_ATOMIC_WRITE_GPOVAL(__GPOValue__)              WRITE_REG(HDP->HDP_GPOVAL, (uint8_t)(__GPOValue__))

