zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal.h
/** @brief  This macros returns value of HDP_GPOVAL register
  *
  * @retval the value to set in HDP_GPOVAL register
  */
#define __HAL_HDP_READ_GPOVAL()                                    READ_REG(HDP->HDP_GPOVAL)

/**
  * @}
  */

/** @addtogroup HDP0_MUX0_Config
  * @{
  */
#define __HAL_HDP0_SELECT_PWR_PWRWAKE_SYS()                        MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX0, \
                                                                              ((uint32_t) 0x00000000))
#define __HAL_HDP0_SELECT_PWR_STOP_FORBIDDEN()                     MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX0, \
                                                                              ((uint32_t) HDP_MUX_MUX0_0))
#define __HAL_HDP0_SELECT_PWR_STDBY_WAKEUP()                       MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX0, \
                                                                              ((uint32_t) HDP_MUX_MUX0_1))
#define __HAL_HDP0_SELECT_PWR_ENCOMP_VDDCORE()                     MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX0, \
                                                                              ((uint32_t) HDP_MUX_MUX0_1 | \
                                                                               HDP_MUX_MUX0_0))
#define __HAL_HDP0_SELECT_BSEC_OUT_SEC_NIDEN()                     MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX0, \
                                                                              ((uint32_t) HDP_MUX_MUX0_2))
#define __HAL_HDP0_SELECT_EXTI_SYS_WAKEUP()                        MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX0, \
                                                                              ((uint32_t) HDP_MUX_MUX0_2 |\
                                                                               HDP_MUX_MUX0_0))
#define __HAL_HDP0_SELECT_DDRCTRL_IP_REQ()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX0, \
                                                                              ((uint32_t) HDP_MUX_MUX0_3))
#define __HAL_HDP0_SELECT_PWR_DDR_RET_ENABLE_N()                   MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX0, \
                                                                              ((uint32_t) HDP_MUX_MUX0_3 |\
                                                                               HDP_MUX_MUX0_0))
#define __HAL_HDP0_SELECT_DTS_CLK_PTAT()                           MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX0, \
                                                                              ((uint32_t) HDP_MUX_MUX0_3 |\
                                                                               HDP_MUX_MUX0_1))
#define __HAL_HDP0_SELECT_SRAM3CTRL_TAMP_ERASE_ACT()               MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX0, \
                                                                              ((uint32_t) HDP_MUX_MUX0_3 |\
                                                                               HDP_MUX_MUX0_2))
#define __HAL_HDP0_SELECT_GPOVAL_0()                               MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX0, \
                                                                              ((uint32_t) HDP_MUX_MUX0_3 |\
                                                                               HDP_MUX_MUX0_2 | HDP_MUX_MUX0_1 | \
                                                                               HDP_MUX_MUX0_0))

/**
  * @}
  */

/** @addtogroup HDP1_MUX1_Config
  * @{
  */
#define __HAL_HDP1_SELECT_PWR_SEL_VTH_VDDCPU()                     MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX1, \
                                                                              ((uint32_t) 0x00000000))
#define __HAL_HDP1_SELECT_PWR_MPU_RAM_LOWSPEED()                   MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX1, \
                                                                              ((uint32_t) HDP_MUX_MUX1_0))
/* Changed macro __HAL_HDP1_SELECT_CA7_nAXIERRIRQ to __HAL_HDP1_SELECT_CA7_NAXIERRIRQ as per MCUAstyle Rule-12 */
/* Only uppercase separated by an underscore should be used. Rule-12  */
#define __HAL_HDP1_SELECT_CA7_NAXIERRIRQ()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX1, \
                                                                              ((uint32_t) HDP_MUX_MUX1_1))
#define __HAL_HDP1_SELECT_PWR_OKIN_MR()                            MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX1, \
                                                                              ((uint32_t) HDP_MUX_MUX1_1 |\
                                                                               HDP_MUX_MUX1_0))
#define __HAL_HDP1_SELECT_BSEC_OUT_SEC_DBGEN()                     MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX1, \
                                                                              ((uint32_t) HDP_MUX_MUX1_2))
#define __HAL_HDP1_SELECT_EXTI_C1_WAKEUP()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX1, \
                                                                              ((uint32_t) HDP_MUX_MUX1_2 |\
                                                                               HDP_MUX_MUX1_0))
#define __HAL_HDP1_SELECT_RCC_PWRDS_MPU()                          MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX1, \
                                                                              ((uint32_t) HDP_MUX_MUX1_2 |\
                                                                               HDP_MUX_MUX1_1))
#define __HAL_HDP1_SELECT_DDRCTRL_DFI_CTRLUPD_REQ()                MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX1, \
                                                                              ((uint32_t) HDP_MUX_MUX1_3))
#define __HAL_HDP1_SELECT_DDRCTRL_CACTIVE_DDRC_ASR()               MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX1, \
                                                                              ((uint32_t) HDP_MUX_MUX1_3 |\
                                                                               HDP_MUX_MUX1_0))
#define __HAL_HDP1_SELECT_SRAM3CTRL_HW_ERASE_ACT()                 MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX1, \
                                                                              ((uint32_t) HDP_MUX_MUX1_3 |\
                                                                               HDP_MUX_MUX1_2))
#define __HAL_HDP1_SELECT_NIC400_S0_BREADY()                       MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX1, \
                                                                              ((uint32_t) HDP_MUX_MUX1_3 |\
                                                                               HDP_MUX_MUX1_2 | HDP_MUX_MUX1_0))
#define __HAL_HDP1_SELECT_GPOVAL_1()                               MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX1, \
                                                                              ((uint32_t) HDP_MUX_MUX1_3 |\
                                                                               HDP_MUX_MUX1_2 | HDP_MUX_MUX1_1 \
                                                                               | HDP_MUX_MUX1_0))

/**
  * @}
  */

/** @addtogroup HDP2_MUX2_Config
  * @{
  */
#define __HAL_HDP2_SELECT_PWR_PWRWAKE_MPU()                        MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX2, \
                                                                              ((uint32_t) 0x00000000))
#define __HAL_HDP2_SELECT_PWR_MPU_CLOCK_DISABLE_ACK()              MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX2, \
                                                                              ((uint32_t) HDP_MUX_MUX2_0))
/* Changed macro __HAL_HDP2_SELECT_CA7_nDBGRESET_i to __HAL_HDP2_SELECT_CA7_NDBGRESET_I as per MCUAstyle Rule-12 */
/* Only uppercase separated by an underscore should be used. Rule-12  */
#define __HAL_HDP2_SELECT_CA7_NDBGRESET_I()                        MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX2, \
                                                                              ((uint32_t) HDP_MUX_MUX2_1))
/* Changed macro __HAL_HDP2_SELECT_BSEC_IN_RSTCORE_n to __HAL_HDP2_SELECT_BSEC_IN_RSTCORE_N as per MCUAstyle Rule-12 */
/* Only uppercase separated by an underscore should be used. Rule-12  */
#define __HAL_HDP2_SELECT_BSEC_IN_RSTCORE_N()                      MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX2, \
                                                                              ((uint32_t) HDP_MUX_MUX2_2))
#define __HAL_HDP2_SELECT_BSEC_OUT_SEC_BSC_DIS()                   MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX2, \
                                                                              ((uint32_t) HDP_MUX_MUX2_2 |\
                                                                               HDP_MUX_MUX2_0))
#define __HAL_HDP2_SELECT_DDRCTRL_DFI_INIT_COMPLETE()              MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX2, \
                                                                              ((uint32_t) HDP_MUX_MUX2_3))
#define __HAL_HDP2_SELECT_DDRCTRL_PERF_OP_IS_REFRESH()             MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX2, \
                                                                              ((uint32_t) HDP_MUX_MUX2_3 |\
                                                                               HDP_MUX_MUX2_0))
#define __HAL_HDP2_SELECT_DDRCTRL_GSKP_DFI_LP_REQ()                MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX2, \
                                                                              ((uint32_t) HDP_MUX_MUX2_3 |\
                                                                               HDP_MUX_MUX2_1))
#define __HAL_HDP2_SELECT_SRAM3CTRL_SW_ERASE_ACT()                 MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX2, \
                                                                              ((uint32_t) HDP_MUX_MUX2_3 |\
                                                                               HDP_MUX_MUX2_2))
#define __HAL_HDP2_SELECT_NIC400_S0_BVALID()                       MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX2, \
                                                                              ((uint32_t) HDP_MUX_MUX2_3 |\
                                                                               HDP_MUX_MUX2_2 | HDP_MUX_MUX2_0))
#define __HAL_HDP2_SELECT_GPOVAL_2()                               MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX2, \
                                                                              ((uint32_t) HDP_MUX_MUX2_3 |\
                                                                               HDP_MUX_MUX2_2 | HDP_MUX_MUX2_1 | \
                                                                               HDP_MUX_MUX2_0))

/**
  * @}
  */

/** @addtogroup HDP3_MUX3_Config
  * @{
  */
#define __HAL_HDP3_SELECT_PWR_SEL_VTH_VDDCORE()                    MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) 0x00000000))
#define __HAL_HDP3_SELECT_PWR_MPU_CLOCK_DISABLE_REQ()              MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_0))
/* Changed macro __HAL_HDP3_SELECT_CA7_nPMUIRQ0 to __HAL_HDP3_SELECT_CA7_NPMUIRQ0 as per MCUAstyle Rule-12 */
/* Only uppercase separated by an underscore should be used. Rule-12  */
#define __HAL_HDP3_SELECT_CA7_NPMUIRQ0()                           MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_1))
/* Changed macro __HAL_HDP3_SELECT_CA7_nFIQOUT0 to __HAL_HDP3_SELECT_CA7_NFIQOUT0 as per MCUAstyle Rule-12 */
/* Only uppercase separated by an underscore should be used. Rule-12  */
#define __HAL_HDP3_SELECT_CA7_NFIQOUT0()                           MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_1 |\
                                                                               HDP_MUX_MUX3_0))
#define __HAL_HDP3_SELECT_BSEC_OUT_SEC_DFTLOCK()                   MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_2))
#define __HAL_HDP3_SELECT_BSEC_OUT_SEC_JTAG_DIS()                  MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_2 |\
                                                                               HDP_MUX_MUX3_0 ))
#define __HAL_HDP3_SELECT_RCC_PWRDS_SYS()                          MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_2 |\
                                                                               HDP_MUX_MUX3_1))
#define __HAL_HDP3_SELECT_SRAM3CTRL_TAMP_ERASE_REQ()               MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_2 |\
                                                                               HDP_MUX_MUX3_1 | HDP_MUX_MUX3_0))
#define __HAL_HDP3_SELECT_DDRCTRL_STAT_DDRC_REG_SELREF_TYPE_0()    MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_3))
#define __HAL_HDP3_SELECT_DTS_VALOBUS1_0()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_3 |\
                                                                               HDP_MUX_MUX3_1))
#define __HAL_HDP3_SELECT_DTS_VALOBUS2_0()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_3 |\
                                                                               HDP_MUX_MUX3_1 | HDP_MUX_MUX3_0))
#define __HAL_HDP3_SELECT_TAMP_POTENTIAL_TAMP_ERFCFG()             MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_3 |\
                                                                               HDP_MUX_MUX3_2))
#define __HAL_HDP3_SELECT_NIC400_S0_WREADY()                       MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_3 |\
                                                                               HDP_MUX_MUX3_2 | HDP_MUX_MUX3_0))
#define __HAL_HDP3_SELECT_NIC400_S0_RREADY()                       MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_3 |\
                                                                               HDP_MUX_MUX3_2 | HDP_MUX_MUX3_1))
#define __HAL_HDP3_SELECT_GPOVAL_3()                               MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX3, \
                                                                              ((uint32_t) HDP_MUX_MUX3_3 |\
                                                                               HDP_MUX_MUX3_2 | HDP_MUX_MUX3_1 | \
                                                                               HDP_MUX_MUX3_0))

/**
  * @}
  */

