zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_hal.h
/** @addtogroup HDP4_MUX4_Config
  * @{
  */
#define __HAL_HDP4_SELECT_PWR_STOP2_ACTIVE()                       MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_0))
/* Changed macro __HAL_HDP4_SELECT_CA7_nl2RESET_i to __HAL_HDP4_SELECT_CA7_N12RESET_I as per MCUAstyle Rule-12 */
/* Only uppercase separated by an underscore should be used. Rule-12  */
#define __HAL_HDP4_SELECT_CA7_N12RESET_I()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_1))
/* Changed macro __HAL_HDP4_SELECT_CA7_nPORESET_VARM_i to __HAL_HDP4_SELECT_CA7_NPORESET_VARM_I as per
   MCUAstyle Rule-12 */
/* Only uppercase separated by an underscore should be used. Rule-12  */
#define __HAL_HDP4_SELECT_CA7_NPORESET_VARM_I()                    MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_1 |\
                                                                               HDP_MUX_MUX4_0))
#define __HAL_HDP4_SELECT_BSEC_OUT_SEC_DFTEN()                     MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_2))
#define __HAL_HDP4_SELECT_BSEC_OUT_SEC_DBGSWENABLE()               MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_2 |\
                                                                               HDP_MUX_MUX4_0))
#define __HAL_HDP4_SELECT_ETH1_OUT_PMT_INTR_0()                    MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_2 |\
                                                                               HDP_MUX_MUX4_1))
#define __HAL_HDP4_SELECT_ETH2_OUT_PMT_INTR_0()                    MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_2 |\
                                                                               HDP_MUX_MUX4_1 | HDP_MUX_MUX4_0))
#define __HAL_HDP4_SELECT_DDRCTRL_STAT_DDRC_REG_SELREF_TYPE_1()    MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_3))
#define __HAL_HDP4_SELECT_DDRCTRL_CACTIVE_0()                      MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_3 |\
                                                                               HDP_MUX_MUX4_0))
#define __HAL_HDP4_SELECT_DTS_VALOBUS1_1()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_3 |\
                                                                               HDP_MUX_MUX4_1))
#define __HAL_HDP4_SELECT_DTS_VALOBUS2_1()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_3 |\
                                                                               HDP_MUX_MUX4_1 | HDP_MUX_MUX4_0))
/* Changed macro __HAL_HDP4_SELECT_TAMP_nRESET_SRAM_ERFCFG to __HAL_HDP4_SELECT_TAMP_NRESET_SRAM_ERFCFG as per
   MCUAstyle Rule-12 */
/* Only uppercase separated by an underscore should be used. Rule-12  */
#define __HAL_HDP4_SELECT_TAMP_NRESET_SRAM_ERFCFG()                MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_3 |\
                                                                               HDP_MUX_MUX4_2))
#define __HAL_HDP4_SELECT_NIC400_S0_WLAST()                        MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_3 |\
                                                                               HDP_MUX_MUX4_2 | HDP_MUX_MUX4_0))
#define __HAL_HDP4_SELECT_NIC400_S0_RLAST()                        MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_3 |\
                                                                               HDP_MUX_MUX4_2 | HDP_MUX_MUX4_1))
#define __HAL_HDP4_SELECT_GPOVAL_4()                               MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX4, \
                                                                              ((uint32_t) HDP_MUX_MUX4_3 |\
                                                                               HDP_MUX_MUX4_2 | HDP_MUX_MUX4_1 | \
                                                                               HDP_MUX_MUX4_0))

/**
  * @}
  */

/** @addtogroup HDP5_MUX5_Config
  * @{
  */
#define __HAL_HDP5_SELECT_CA7_STANDBYWFIL2()                       MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) 0x00000000))
#define __HAL_HDP5_SELECT_PWR_VTH_VDDCORE_ACK()                    MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_0))
/* Changed macro __HAL_HDP5_SELECT_CA7_nCORERESET_i to __HAL_HDP5_SELECT_CA7_NCORERESET_I as per
   MCUAstyle Rule-12 */
/* Only uppercase separated by an underscore should be used. Rule-12  */
#define __HAL_HDP5_SELECT_CA7_NCORERESET_I()                       MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_1))
/* Changed macro __HAL_HDP5_SELECT_CA7_nIRQOUT0 to __HAL_HDP5_SELECT_CA7_NIRQOUT0 as per
   MCUAstyle Rule-12 */
/* Only uppercase separated by an underscore should be used. Rule-12  */
#define __HAL_HDP5_SELECT_CA7_NIRQOUT0()                           MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_1 |\
                                                                               HDP_MUX_MUX5_0))
#define __HAL_HDP5_SELECT_BSEC_IN_PWROK()                          MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_2))
#define __HAL_HDP5_SELECT_BSEC_OUT_SEC_DEVICEEN()                  MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_2 |\
                                                                               HDP_MUX_MUX5_0))
#define __HAL_HDP5_SELECT_ETH1_OUT_LPI_INTR_0()                    MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_2 |\
                                                                               HDP_MUX_MUX5_1))
#define __HAL_HDP5_SELECT_ETH2_OUT_LPI_INTR_0()                    MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_2 |\
                                                                               HDP_MUX_MUX5_1 | HDP_MUX_MUX5_0))
#define __HAL_HDP5_SELECT_DDRCTRL_CACTIVE_DDRC()                   MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_3))
#define __HAL_HDP5_SELECT_DDRCTRL_WR_CREDIT_CNT_4_0()              MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_3 |\
                                                                               HDP_MUX_MUX5_0))
#define __HAL_HDP5_SELECT_DTS_VALOBUS1_2()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_3 |\
                                                                               HDP_MUX_MUX5_1))
#define __HAL_HDP5_SELECT_DTS_VALOBUS2_2()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_3 |\
                                                                               HDP_MUX_MUX5_1 | HDP_MUX_MUX5_0))
/* Changed macro __HAL_HDP5_SELECT_PKA_iTAMP_OUT to __HAL_HDP5_SELECT_PKA_ITAMP_OUT as per
   MCUAstyle Rule-12 */
/* Only uppercase separated by an underscore should be used. Rule-12  */
#define __HAL_HDP5_SELECT_PKA_ITAMP_OUT()                          MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_3 |\
                                                                               HDP_MUX_MUX5_2))
#define __HAL_HDP5_SELECT_NIC400_S0_WVALID()                       MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_3 |\
                                                                               HDP_MUX_MUX5_2 | HDP_MUX_MUX5_0))
#define __HAL_HDP5_SELECT_NIC400_S0_RVALID()                       MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_3 |\
                                                                               HDP_MUX_MUX5_2 | HDP_MUX_MUX5_1))
#define __HAL_HDP5_SELECT_GPOVAL_5()                               MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX5, \
                                                                              ((uint32_t) HDP_MUX_MUX5_3 |\
                                                                               HDP_MUX_MUX5_2 | HDP_MUX_MUX5_1 | \
                                                                               HDP_MUX_MUX5_0))
/**
  * @}
  */

/** @addtogroup HDP6_MUX6_Config
  * @{
  */
#define __HAL_HDP6_SELECT_CA7_STANDBYWFE0()                        MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) 0x00000000))
#define __HAL_HDP6_SELECT_PWR_VTH_VDDCPU_ACK()                     MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_0))
#define __HAL_HDP6_SELECT_CA7_EVENTO()                             MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_1))
#define __HAL_HDP6_SELECT_BSEC_IN_TAMPER_DET()                     MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_2))
#define __HAL_HDP6_SELECT_BSEC_OUT_SEC_SPNIDEN()                   MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_2 |\
                                                                               HDP_MUX_MUX6_0))
#define __HAL_HDP6_SELECT_ETH1_OUT_MAC_SPEED_O1()                  MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_2 |\
                                                                               HDP_MUX_MUX6_1))
#define __HAL_HDP6_SELECT_ETH2_OUT_MAC_SPEED_O1()                  MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_2 |\
                                                                               HDP_MUX_MUX6_1 | HDP_MUX_MUX6_0))
#define __HAL_HDP6_SELECT_DDRCTRL_CSYSACK_DDRC()                   MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_3))
#define __HAL_HDP6_SELECT_DDRCTRL_LPR_CREDIT_CNT_4_0()             MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_3 |\
                                                                               HDP_MUX_MUX6_0))
#define __HAL_HDP6_SELECT_DTS_VALOBUS1_3()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_3 |\
                                                                               HDP_MUX_MUX6_1))
#define __HAL_HDP6_SELECT_DTS_VALOBUS2_3()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_3 |\
                                                                               HDP_MUX_MUX6_1 | HDP_MUX_MUX6_0))
#define __HAL_HDP6_SELECT_SAES_TAMPER_OUT()                        MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_3 |\
                                                                               HDP_MUX_MUX6_2))
#define __HAL_HDP6_SELECT_NIC400_S0_AWREADY()                      MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_3 |\
                                                                               HDP_MUX_MUX6_2 | HDP_MUX_MUX6_0))
#define __HAL_HDP6_SELECT_NIC400_S0_ARREADY()                      MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_3 |\
                                                                               HDP_MUX_MUX6_2 | HDP_MUX_MUX6_1))
#define __HAL_HDP6_SELECT_GPOVAL_6()                               MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX6, \
                                                                              ((uint32_t) HDP_MUX_MUX6_3 |\
                                                                               HDP_MUX_MUX6_2 | HDP_MUX_MUX6_1 | \
                                                                               HDP_MUX_MUX6_0))

/**
  * @}
  */

/** @addtogroup HDP7_MUX7_Config
  * @{
  */
#define __HAL_HDP7_SELECT_CA7_STANDBYWFI0()                        MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) 0x00000000))
#define __HAL_HDP7_SELECT_PWR_RCC_VCPU_RDY()                       MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_0))
#define __HAL_HDP7_SELECT_CA7_EVENTI()                             MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_1))
#define __HAL_HDP7_SELECT_CA7_DBGACK0()                            MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_1 |\
                                                                               HDP_MUX_MUX7_0))
#define __HAL_HDP7_SELECT_BSEC_OUT_FUSE_OK()                       MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_2))
#define __HAL_HDP7_SELECT_BSEC_OUT_SEC_SPIDEN()                    MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_2 |\
                                                                               HDP_MUX_MUX7_0))
#define __HAL_HDP7_SELECT_ETH1_OUT_MAC_SPEED_O0()                  MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_2 |\
                                                                               HDP_MUX_MUX7_1))
#define __HAL_HDP7_SELECT_ETH2_OUT_MAC_SPEED_O0()                  MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_2 |\
                                                                               HDP_MUX_MUX7_1 | HDP_MUX_MUX7_0))
#define __HAL_HDP7_SELECT_DDRCTRL_CSYSREQ_DDRC()                   MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_3))
#define __HAL_HDP7_SELECT_DDRCTRL_HPR_CREDIT_CNT_4_0()             MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_3 |\
                                                                               HDP_MUX_MUX7_0))
#define __HAL_HDP7_SELECT_DTS_VALOBUS1_4()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_3 |\
                                                                               HDP_MUX_MUX7_1))
#define __HAL_HDP7_SELECT_DTS_VALOBUS2_4()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_3 |\
                                                                               HDP_MUX_MUX7_1 | HDP_MUX_MUX7_0))
#define __HAL_HDP7_SELECT_RNG_TAMPER_OUT()                         MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_3 |\
                                                                               HDP_MUX_MUX7_2))
#define __HAL_HDP7_SELECT_NIC400_S0_AWAVALID()                     MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_3 |\
                                                                               HDP_MUX_MUX7_2 | HDP_MUX_MUX7_0))
#define __HAL_HDP7_SELECT_NIC400_S0_ARAVALID()                     MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_3 |\
                                                                               HDP_MUX_MUX7_2 | HDP_MUX_MUX7_1))
#define __HAL_HDP7_SELECT_GPOVAL_7()                               MODIFY_REG(HDP->HDP_MUX, HDP_MUX_MUX7, \
                                                                              ((uint32_t) HDP_MUX_MUX7_3 |\
                                                                               HDP_MUX_MUX7_2 | HDP_MUX_MUX7_1 | \
                                                                               HDP_MUX_MUX7_0))
/**
  * @}
  */

/**
  * @}
  */


